In [68]:
import pandas as pd
import numpy as np

In [69]:
sozlukVerisi={"Istanbul" :[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [70]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [71]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [72]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [73]:
yeniVeri={"Istanbul" :[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [74]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [75]:
yeniDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [76]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

In [77]:
yeniDataFrame.fillna("?")

  Istanbul Ankara  Izmir Antalya
0     30.0   20.0     40    45.0
1     29.0      ?     39       ?
2        ?   25.0     38       ?

## groupby

In [100]:
maasSozlugu = {"Departman" : ["Yazilim","Yazilim","Pazarlama","Pazarlama","Finans","Finans","Hukuk","Hukuk"],
               "Calisan Ismi": ["Ahmet","Mehmet","Yavuz","Selim","Furkan","Muslim","Celal","Ziya"],
                "Maas": [380,300,280,340,350,300,400,300]}

In [101]:
maasDataFrame=pd.DataFrame(maasSozlugu)
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazilim        Ahmet   380
1    Yazilim       Mehmet   300
2  Pazarlama        Yavuz   280
3  Pazarlama        Selim   340
4     Finans       Furkan   350
5     Finans       Muslim   300
6      Hukuk        Celal   400
7      Hukuk         Ziya   300

In [102]:
maasDataFrame.groupby("Departman")

In [103]:
grupObjesi=maasDataFrame.groupby("Departman")

In [104]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Finans                2     2
Hukuk                 2     2
Pazarlama             2     2
Yazilim               2     2

In [108]:
grupObjesi.mean("Maas")

            Maas
Departman
Finans     325.0
Hukuk      350.0
Pazarlama  310.0
Yazilim    340.0

In [116]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Finans          Furkan   300
Hukuk            Celal   300
Pazarlama        Selim   280
Yazilim          Ahmet   300

In [117]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Finans      2.0  325.0  35.355339  300.0  312.5  325.0  337.5  350.0
Hukuk       2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Pazarlama   2.0  310.0  42.426407  280.0  295.0  310.0  325.0  340.0
Yazilim     2.0  340.0  56.568542  300.0  320.0  340.0  360.0  380.0